# Information Systems for Engineers 2021 - Cheat Sheet

During the exam, you will be required to write SQL queries using a Jupyter notebook.

This notebook is designed to help you start writing your queries by providing you an environment with the datasets loaded and a simple query that you can use to recap the syntax of SQL.

Feel free to extend this notebook and use it for preparing the answers you need for the exam. Take into account that the content of this notebook will not be considered for grading.

## SQL

There is a local PostgreSQL 12 installation with a dataset loaded into a database. Run the next cell to connect to it.

In [1]:
%load_ext sql
%sql  postgresql://postgres:example@db

To print the tables currently loaded in the database run:

In [2]:
%%sql

SELECT * 
FROM INFORMATION_SCHEMA.TABLES 
WHERE TABLE_TYPE = 'BASE TABLE' and TABLE_CATALOG = 'postgres' and TABLE_SCHEMA = 'public'
LIMIT 4;

 * postgresql://postgres:***@db
4 rows affected.

[('postgres', 'public', 'categories', 'BASE TABLE', None, None, None, None, None, 'YES', 'NO', None),
 ('postgres', 'public', 'customers', 'BASE TABLE', None, None, None, None, None, 'YES', 'NO', None),
 ('postgres', 'public', 'nwemployees', 'BASE TABLE', None, None, None, None, None, 'YES', 'NO', None),
 ('postgres', 'public', 'employeeterritories', 'BASE TABLE', None, None, None, None, None, 'YES', 'NO', None)]

To print the attributes of a particular table (`employees`, for example) run:

In [3]:
%%sql

SELECT column_name, data_type, character_maximum_length
FROM INFORMATION_SCHEMA.COLUMNS 
WHERE table_name = 'employees'
LIMIT 4;

 * postgresql://postgres:***@db
4 rows affected.

[('emp_no', 'integer', None),
 ('birth_date', 'date', None),
 ('gender', 'USER-DEFINED', None),
 ('hire_date', 'date', None)]

## Useful SQL Keywords

The Keyword `SELECT DISTINCT` is used to return only distinct values. For example:

In [4]:
%%sql
SELECT DISTINCT title FROM titles;

 * postgresql://postgres:***@db
7 rows affected.

[('Engineer',),
 ('Senior Engineer',),
 ('Manager',),
 ('Assistant Engineer',),
 ('Staff',),
 ('Senior Staff',),
 ('Technique Leader',)]

The keyword `EXTRACT` is used to access the components of temporal data types (i.e. date, time, timestamp, and interval). For example:

In [5]:
%%sql
SELECT * FROM titles WHERE EXTRACT(YEAR FROM to_date) < 1987;

 * postgresql://postgres:***@db
2 rows affected.

[(10541, 'Staff', datetime.date(1986, 2, 28), datetime.date(1986, 10, 1)),
 (10905, 'Senior Engineer', datetime.date(1985, 2, 28), datetime.date(1986, 3, 7))]

## Exam database − data about employees of a company

The dataset consists of relations containing information such as titles, birth dates and salaires about employees of a (fictitious) company. 

Here is some basic information on the database tables.

### 1) `departments` table

Contains the mapping from the identifier `dept_no` to `dept_name`.

* `dept_no` is the identifier of the department.

* `dept_name` is the name of the department.

In [6]:
%%sql
SELECT * FROM departments
LIMIT 4;

 * postgresql://postgres:***@db
4 rows affected.

[('d001', 'Marketing'),
 ('d002', 'Finance'),
 ('d003', 'Human Resources'),
 ('d004', 'Production')]

### 2) `dept_emp` table

Contains information about which departments employees work for.

* `emp_no` is the employee id as defined in the `employees` table.
* `dept_no` is the department id.
* `from_date` is the date from which the employee has been employed by the department.
* `to_date` is the date until which the employee has been employed by the department.

Note that the date `9999-01-01` indicates that the employee is still employed by this particular department.

In [7]:
%%sql
SELECT * FROM dept_emp LIMIT 4;

 * postgresql://postgres:***@db
4 rows affected.

[(10001, 'd005', datetime.date(1986, 6, 26), datetime.date(9999, 1, 1)),
 (10002, 'd007', datetime.date(1996, 8, 3), datetime.date(9999, 1, 1)),
 (10003, 'd004', datetime.date(1995, 12, 3), datetime.date(9999, 1, 1)),
 (10004, 'd004', datetime.date(1986, 12, 1), datetime.date(9999, 1, 1))]

### 3) `dept_manager` table

Contains information about which employee has been the manager of a department and during which time.

* `emp_no` is the employee id as defined in the `employees` table.
* `dept_no` is the department id.
* `from_date` is the date from which the employee was manager of the department.
* `to_date` is the date until which the employee was manager of the department.

Note that the date `9999-01-01` indicates that the employee is still the manager of this particular department.

In [8]:
%%sql
SELECT * FROM dept_manager LIMIT 4;

 * postgresql://postgres:***@db
4 rows affected.

[(11001, 'd001', datetime.date(1985, 1, 1), datetime.date(1991, 10, 1)),
 (11002, 'd001', datetime.date(1991, 10, 1), datetime.date(9999, 1, 1)),
 (11003, 'd002', datetime.date(1985, 1, 1), datetime.date(1989, 12, 17)),
 (11004, 'd002', datetime.date(1989, 12, 17), datetime.date(9999, 1, 1))]

### 4) `employees` table

Contains information about each employee of the company.

* `emp_no` is the employee id as defined in the `employees` table.
* `birth_date` is the birth date of the employee.
* `first_name` if the first name of the employee.
* `last_name` is the last name of the employee.
* `gender` is the gender of the employee.
* `hire_date` is the date on which the employee was hired.

In [9]:
%%sql
SELECT * FROM employees LIMIT 4;

 * postgresql://postgres:***@db
4 rows affected.

[(10001, datetime.date(1953, 9, 2), 'Georgi', 'Facello', 'M', datetime.date(1986, 6, 26)),
 (10002, datetime.date(1964, 6, 2), 'Bezalel', 'Simmel', 'F', datetime.date(1985, 11, 21)),
 (10003, datetime.date(1959, 12, 3), 'Parto', 'Bamford', 'M', datetime.date(1986, 8, 28)),
 (10004, datetime.date(1954, 5, 1), 'Chirstian', 'Koblick', 'M', datetime.date(1986, 12, 1))]

### 5) `salaries` table

Contains information about the salaries of employees.

* `emp_no` is the employee id as defined in the `employees` table.
* `salary` is the salary which the employed is / was paid.
* `from_date` is the date from which the employee was paid the salary specified in the `salary` attribute.
* `to_date` is the date until which the employee was paid the salary specified in the `salary` attribute.

Note that the date `9999-01-01` indicates that the employee is currently being paid the salary specified in the `salary` attribute.

In [10]:
%%sql
SELECT * FROM salaries LIMIT 4;

 * postgresql://postgres:***@db
4 rows affected.

[(10001, 60117, datetime.date(1986, 6, 26), datetime.date(1987, 6, 26)),
 (10001, 62102, datetime.date(1987, 6, 26), datetime.date(1988, 6, 25)),
 (10001, 66074, datetime.date(1988, 6, 25), datetime.date(1989, 6, 25)),
 (10001, 66596, datetime.date(1989, 6, 25), datetime.date(1990, 6, 25))]

### 6) `titles` table

Contains information about the titles of employees.

* `emp_no` is the employee id as defined in the `employees` table.
* `title` is the title which the employee holds/held.
* `from_date` is the date from which the employee held the title specified in the `title` attribute.
* `to_date` is the date until which the employee held the title specified in the `title` attribute.

Note that the date `9999-01-01` indicates that the employee currently holds the title specified in the `title` attribute.

In [11]:
%%sql
SELECT * FROM titles LIMIT 4;

 * postgresql://postgres:***@db
4 rows affected.

[(10001, 'Senior Engineer', datetime.date(1986, 6, 26), datetime.date(9999, 1, 1)),
 (10002, 'Staff', datetime.date(1996, 8, 3), datetime.date(9999, 1, 1)),
 (10003, 'Senior Engineer', datetime.date(1995, 12, 3), datetime.date(9999, 1, 1)),
 (10004, 'Engineer', datetime.date(1986, 12, 1), datetime.date(1995, 12, 1))]

##### Note: the examples provided above do not contain all the query operations you might need during the exam.

Now its your turn, you can write all your queries in new cells below. Feel free to add as many cells as needed.

---

# Round 1

In [12]:
%%sql
SELECT COUNT(DISTINCT first_name)
FROM employees;

 * postgresql://postgres:***@db
1 rows affected.

[(706,)]

In [13]:
%%sql
SELECT COUNT(*)
FROM employees
WHERE gender = 'F' AND birth_date >= '1960-01-01'
LIMIT 10;

 * postgresql://postgres:***@db
1 rows affected.

[(150,)]

In [14]:
%%sql
SELECT COUNT(DISTINCT emp_no)
FROM dept_emp 
WHERE dept_no = 'd008' AND to_date = '9999-01-01'
LIMIT 4;

 * postgresql://postgres:***@db
1 rows affected.

[(53,)]

In [15]:
%%sql
SELECT ROUND(AVG(salary))
FROM dept_emp d
JOIN salaries s
ON s.emp_no = d.emp_no
WHERE d.dept_no = 'd004'
LIMIT 4;

 * postgresql://postgres:***@db
1 rows affected.

[(Decimal('59829'),)]

In [16]:
%%sql
SELECT MIN(s.salary)
FROM employees e
JOIN salaries s
ON s.emp_no = e.emp_no
JOIN titles t
ON t.emp_no = e.emp_no
WHERE t.title = 'Senior Engineer' AND s.to_date = '9999-01-01'
LIMIT 10;

 * postgresql://postgres:***@db
1 rows affected.

[(43311,)]

In [17]:
%%sql
SELECT COUNT(*)
FROM employees e
JOIN dept_emp d
ON e.emp_no = d.emp_no
WHERE e.gender = 'F' AND d.to_date='9999-01-01' AND d.dept_no = 'd006'
LIMIT 10;

 * postgresql://postgres:***@db
1 rows affected.

[(18,)]

In [18]:
%%sql
SELECT *
FROM dept_emp
LIMIT 10;

 * postgresql://postgres:***@db
10 rows affected.

[(10001, 'd005', datetime.date(1986, 6, 26), datetime.date(9999, 1, 1)),
 (10002, 'd007', datetime.date(1996, 8, 3), datetime.date(9999, 1, 1)),
 (10003, 'd004', datetime.date(1995, 12, 3), datetime.date(9999, 1, 1)),
 (10004, 'd004', datetime.date(1986, 12, 1), datetime.date(9999, 1, 1)),
 (10005, 'd003', datetime.date(1989, 9, 12), datetime.date(9999, 1, 1)),
 (10006, 'd005', datetime.date(1990, 8, 5), datetime.date(9999, 1, 1)),
 (10007, 'd008', datetime.date(1989, 2, 10), datetime.date(9999, 1, 1)),
 (10008, 'd005', datetime.date(1998, 3, 11), datetime.date(2000, 7, 31)),
 (10009, 'd006', datetime.date(1985, 2, 18), datetime.date(9999, 1, 1)),
 (10010, 'd004', datetime.date(1996, 11, 24), datetime.date(2000, 6, 26))]

In [19]:
%%sql
SELECT MIN(e.hire_date) AS min_date
FROM employees e
JOIN dept_emp d
ON e.emp_no = d.emp_no
JOIN departments dt
ON dt.dept_no = d.dept_no
WHERE dt.dept_no = (SELECT dept_no
                    FROM employees e2
                    JOIN dept_emp d2
                    ON e2.emp_no = d2.emp_no
                    GROUP BY d2.dept_no
                    ORDER BY MAX(e2.hire_date) DESC
                    LIMIT 1);

 * postgresql://postgres:***@db
1 rows affected.

[(datetime.date(1985, 1, 1),)]

In [20]:
%%sql
SELECT e.first_name
FROM employees e 
JOIN titles t
ON t.emp_no = e.emp_no
WHERE t.title = 'Senior Engineer' AND e.emp_no IN
    (SELECT emp_no
    FROM salaries
    GROUP BY emp_no
    HAVING COUNT(*) < 5 OR COUNT(*) > 15)
ORDER BY hire_date DESC
LIMIT 1

 * postgresql://postgres:***@db
1 rows affected.

[('Kazuhito',)]

In [21]:
%%sql
SELECT COUNT(*)
FROM employees e
JOIN dept_emp d
ON e.emp_no = d.emp_no
WHERE   d.to_date = '9999-01-01' AND 
        EXTRACT(year FROM birth_date) = 1959 AND
        d.dept_no = 'd008'
LIMIT 10;

 * postgresql://postgres:***@db
1 rows affected.

[(7,)]

---

# Round 2

In [22]:
%%sql
SELECT COUNT(DISTINCT first_name)
FROM employees
LIMIT 10;

 * postgresql://postgres:***@db
1 rows affected.

[(706,)]

In [23]:
%%sql
SELECT COUNT(*)
FROM employees
WHERE gender = 'F' AND birth_date >= '1960-01-01'
LIMIT 10;

 * postgresql://postgres:***@db
1 rows affected.

[(150,)]

In [24]:
%%sql
SELECT COUNT(*)
FROM employees e
JOIN dept_emp de
ON e.emp_no = de.emp_no
JOIN departments d
ON d.dept_no = de.dept_no
WHERE d.dept_name = 'Research' AND de.to_date = '9999-01-01'
LIMIT 10;

 * postgresql://postgres:***@db
1 rows affected.

[(53,)]

In [25]:
%%sql
SELECT ROUND(AVG(salary),0) AS avg_salary
FROM employees e
JOIN dept_emp de
ON e.emp_no = de.emp_no
JOIN departments d
ON d.dept_no = de.dept_no
JOIN salaries s
ON e.emp_no = s.emp_no
WHERE d.dept_name = 'Production'
LIMIT 10;

 * postgresql://postgres:***@db
1 rows affected.

[(Decimal('59829'),)]

In [26]:
%%sql
SELECT *
FROM titles t
JOIN employees e
ON t.emp_no = e.emp_no
JOIN salaries s
ON e.emp_no = s.emp_no
WHERE s.to_date = '9999-01-01' AND t.title = 'Senior Engineer'
ORDER BY s.salary ASC
LIMIT 1;

 * postgresql://postgres:***@db
1 rows affected.

[(10003, 'Senior Engineer', datetime.date(1995, 12, 3), datetime.date(9999, 1, 1), 10003, datetime.date(1959, 12, 3), 'Parto', 'Bamford', 'M', datetime.date(1986, 8, 28), 10003, 43311, datetime.date(2001, 12, 1), datetime.date(9999, 1, 1))]

In [27]:
%%sql
SELECT COUNT(*)
FROM employees e
JOIN dept_emp de
ON e.emp_no = de.emp_no
JOIN departments d
ON d.dept_no = de.dept_no
WHERE d.dept_name = 'Quality Management' AND e.gender = 'F' AND de.to_date = '9999-01-01'
LIMIT 10;

 * postgresql://postgres:***@db
1 rows affected.

[(18,)]

In [28]:
%%sql
SELECT MIN(hire_date)
FROM employees e
JOIN dept_emp de
ON de.emp_no = e.emp_no
JOIN departments d
ON d.dept_no = de.dept_no
WHERE de.dept_no = (SELECT de.dept_no
                    FROM employees e
                    JOIN dept_emp de
                    ON de.emp_no = e.emp_no
                    GROUP BY de.dept_no
                    ORDER BY MAX(e.hire_date) DESC
                    LIMIT 1)
LIMIT 10;

 * postgresql://postgres:***@db
1 rows affected.

[(datetime.date(1985, 1, 1),)]

In [29]:
%%sql
SELECT de.dept_no, MAX(e.hire_date) AS max_dept_hire
FROM employees e
JOIN dept_emp de
ON de.emp_no = e.emp_no
                    GROUP BY de.dept_no
                    ORDER BY max_dept_hire
LIMIT 10;

 * postgresql://postgres:***@db
9 rows affected.

[('d001', datetime.date(1997, 7, 19)),
 ('d009', datetime.date(1998, 3, 4)),
 ('d005', datetime.date(1998, 7, 13)),
 ('d006', datetime.date(1998, 10, 6)),
 ('d007', datetime.date(1998, 10, 7)),
 ('d002', datetime.date(1998, 10, 16)),
 ('d003', datetime.date(1999, 3, 23)),
 ('d008', datetime.date(1999, 4, 30)),
 ('d004', datetime.date(1999, 10, 28))]

In [30]:
%%sql
SELECT first_name
FROM employees e
JOIN titles t
ON e.emp_no = t.emp_no
WHERE e.emp_no IN
    (SELECT emp_no
    FROM salaries s
    GROUP BY emp_no
    HAVING COUNT(*) < 5 OR COUNT(*) > 15) AND
    title = 'Senior Engineer'
ORDER BY e.hire_date DESC
LIMIT 1;

 * postgresql://postgres:***@db
1 rows affected.

[('Kazuhito',)]

In [31]:
%%sql
SELECT COUNT(*)
FROM employees e
JOIN dept_emp de
ON e.emp_no = de.emp_no
JOIN departments d
ON d.dept_no = de.dept_no
WHERE EXTRACT(year FROM e.birth_date) = 1959 AND
        d.dept_name = 'Research' AND
        de.to_date = '9999-01-01'
LIMIT 10;

 * postgresql://postgres:***@db
1 rows affected.

[(7,)]

---

# Round 3

In [32]:
%%sql
SELECT COUNT(DISTINCT first_name)
FROM employees
LIMIT 10;

 * postgresql://postgres:***@db
1 rows affected.

[(706,)]

In [33]:
%%sql
SELECT COUNT(DISTINCT emp_no)
FROM employees
WHERE gender = 'F' AND birth_date >= '1960-01-01'
LIMIT 10;

 * postgresql://postgres:***@db
1 rows affected.

[(150,)]

In [34]:
%%sql
SELECT COUNT(e.emp_no)
FROM employees e
JOIN dept_emp de
ON e.emp_no = de.emp_no
JOIN departments d
ON d.dept_no = de.dept_no
WHERE d.dept_name = 'Research' AND de.to_date = '9999-01-01'
LIMIT 10;

 * postgresql://postgres:***@db
1 rows affected.

[(53,)]

In [35]:
%%sql
SELECT ROUND(AVG(s.salary),0)
FROM salaries s
JOIN dept_emp de
ON s.emp_no = de.emp_no
JOIN departments d
ON d.dept_no = de.dept_no
WHERE d.dept_name = 'Production'
LIMIT 10;

 * postgresql://postgres:***@db
1 rows affected.

[(Decimal('59829'),)]

In [36]:
%%sql
SELECT *
FROM titles t
JOIN employees e
ON t.emp_no = e.emp_no
JOIN salaries s
ON e.emp_no = s.emp_no
WHERE s.to_date = '9999-01-01' AND t.title = 'Senior Engineer'
ORDER BY s.salary ASC
LIMIT 1;

 * postgresql://postgres:***@db
1 rows affected.

[(10003, 'Senior Engineer', datetime.date(1995, 12, 3), datetime.date(9999, 1, 1), 10003, datetime.date(1959, 12, 3), 'Parto', 'Bamford', 'M', datetime.date(1986, 8, 28), 10003, 43311, datetime.date(2001, 12, 1), datetime.date(9999, 1, 1))]

In [37]:
%%sql
SELECT *
FROM employees e
JOIN dept_emp de
ON de.emp_no = e.emp_no
JOIN titles t
ON t.emp_no = e.emp_no
JOIN salaries s
ON s.emp_no = e.emp_no
WHERE t.title = 'Senior Engineer' AND s.to_date = '9999-01-01'
ORDER BY salary ASC
LIMIT 1;

 * postgresql://postgres:***@db
1 rows affected.

[(10003, datetime.date(1959, 12, 3), 'Parto', 'Bamford', 'M', datetime.date(1986, 8, 28), 10003, 'd004', datetime.date(1995, 12, 3), datetime.date(9999, 1, 1), 10003, 'Senior Engineer', datetime.date(1995, 12, 3), datetime.date(9999, 1, 1), 10003, 43311, datetime.date(2001, 12, 1), datetime.date(9999, 1, 1))]

In [38]:
%%sql
SELECT COUNT(e.emp_no)
FROM employees e
JOIN dept_emp de
ON e.emp_no = de.emp_no
JOIN departments d
ON d.dept_no = de.dept_no
WHERE d.dept_name = 'Quality Management' AND de.to_date = '9999-01-01' AND gender='F'
LIMIT 10;

 * postgresql://postgres:***@db
1 rows affected.

[(18,)]

In [39]:
%%sql
SELECT MIN(e.hire_date)
FROM employees e
JOIN dept_emp de
ON e.emp_no = de.emp_no
JOIN departments d
ON d.dept_no = de.dept_no
WHERE d.dept_no = (SELECT de.dept_no
                    FROM employees e
                    JOIN dept_emp de
                    ON e.emp_no = de.emp_no
                    GROUP BY de.dept_no
                    ORDER BY MAX(hire_date) DESC
                    LIMIT 1)
LIMIT 10;

 * postgresql://postgres:***@db
1 rows affected.

[(datetime.date(1985, 1, 1),)]

In [40]:
%%sql
SELECT first_name
FROM employees e
JOIN salaries s
ON s.emp_no = e.emp_no
JOIN titles t
ON t.emp_no = e.emp_no
WHERE title = 'Senior Engineer' AND e.emp_no IN (SELECT emp_no
                                                FROM salaries s
                                                GROUP BY emp_no
                                                HAVING COUNT(*) < 5 OR COUNT(*) > 15)
ORDER BY hire_date DESC
LIMIT 1;

 * postgresql://postgres:***@db
1 rows affected.

[('Kazuhito',)]

In [41]:
%%sql
SELECT COUNT(*)
FROM employees e
JOIN dept_emp de
ON e.emp_no = de.emp_no
JOIN departments d
ON d.dept_no = de.dept_no
WHERE EXTRACT(year from birth_date) = 1959 AND d.dept_name = 'Research' AND de.to_date='9999-01-01'
LIMIT 10;

 * postgresql://postgres:***@db
1 rows affected.

[(7,)]

---

# Round 4

In [42]:
%%sql
SELECT COUNT(DISTINCT first_name)
FROM employees
LIMIT 10;

 * postgresql://postgres:***@db
1 rows affected.

[(706,)]

In [43]:
%%sql
SELECT COUNT(*)
FROM employees
WHERE gender = 'F' AND birth_date >= '1960-01-01'
LIMIT 10

 * postgresql://postgres:***@db
1 rows affected.

[(150,)]

In [44]:
%%sql
SELECT COUNT(*)
FROM employees e
JOIN dept_emp de
ON e.emp_no = de.emp_no
JOIN departments d
ON d.dept_no = de.dept_no
WHERE dept_name = 'Research' AND to_date = '9999-01-01'
LIMIT 10

 * postgresql://postgres:***@db
1 rows affected.

[(53,)]

In [45]:
%%sql
SELECT ROUND(AVG(salary), 0)
FROM employees e
JOIN dept_emp de
ON e.emp_no = de.emp_no
JOIN departments d
ON d.dept_no = de.dept_no
JOIN salaries s
ON s.emp_no = e.emp_no
WHERE dept_name = 'Production'
LIMIT 10

 * postgresql://postgres:***@db
1 rows affected.

[(Decimal('59829'),)]

In [46]:
%%sql
SELECT MIN(salary)
FROM employees e
JOIN titles t
ON e.emp_no = t.emp_no
JOIN salaries s
ON s.emp_no = e.emp_no
WHERE s.to_date = '9999-01-01' AND title = 'Senior Engineer'
LIMIT 10

 * postgresql://postgres:***@db
1 rows affected.

[(43311,)]

In [47]:
%%sql
SELECT COUNT(*)
FROM employees e
JOIN dept_emp de
ON e.emp_no = de.emp_no
JOIN departments d
ON d.dept_no = de.dept_no
WHERE dept_name = 'Quality Management' AND gender = 'F' AND to_date = '9999-01-01'
LIMIT 10

 * postgresql://postgres:***@db
1 rows affected.

[(18,)]

In [48]:
%%sql
SELECT MIN(hire_date) AS min_date
FROM employees e
JOIN dept_emp de
ON e.emp_no = de.emp_no
JOIN departments d
ON d.dept_no = de.dept_no
WHERE de.dept_no = (
                SELECT de.dept_no
                FROM employees e
                JOIN dept_emp de
                ON de.emp_no = e.emp_no
                GROUP BY de.dept_no
                ORDER BY  MAX(hire_date) DESC
                LIMIT 1)

 * postgresql://postgres:***@db
1 rows affected.

[(datetime.date(1985, 1, 1),)]

In [49]:
%%sql
SELECT e.first_name
FROM employees e
JOIN titles t
ON t.emp_no = e.emp_no
JOIN salaries s
ON s.emp_no = e.emp_no
WHERE title = 'Senior Engineer'
GROUP BY e.emp_no, e.first_name
HAVING COUNT(s.salary) < 5 OR COUNT(s.salary) > 15
ORDER BY hire_date DESC
LIMIT 1;

 * postgresql://postgres:***@db
1 rows affected.

[('Kazuhito',)]

In [50]:
%%sql
SELECT COUNT(*)
FROM employees e
JOIN dept_emp de
ON de.emp_no = e.emp_no
JOIN departments d
ON d.dept_no = de.dept_no
WHERE EXTRACT(year FROM birth_date) = 1959 AND to_date = '9999-01-01' AND d.dept_name = 'Research'
LIMIT 10

 * postgresql://postgres:***@db
1 rows affected.

[(7,)]

---

# Round 5

In [51]:
%%sql
SELECT COUNT(DISTINCT first_name)
FROM employees
LIMIT 10;

 * postgresql://postgres:***@db
1 rows affected.

[(706,)]

In [52]:
%%sql
SELECT COUNT(DISTINCT emp_no)
FROM employees
WHERE birth_date >= '1960-01-01' AND gender = 'F'
LIMIT 10;

 * postgresql://postgres:***@db
1 rows affected.

[(150,)]

In [53]:
%%sql
SELECT COUNT(DISTINCT e.emp_no)
FROM employees e
JOIN dept_emp de
ON e.emp_no = de.emp_no
JOIN departments d
ON de.dept_no = d.dept_no
WHERE d.dept_name = 'Research' AND to_date = '9999-01-01'
LIMIT 10;

 * postgresql://postgres:***@db
1 rows affected.

[(53,)]

In [54]:
%%sql
SELECT ROUND(AVG(salary),0)
FROM employees e
JOIN dept_emp de
ON e.emp_no = de.emp_no
JOIN departments d
ON d.dept_no = de.dept_no
JOIN salaries s
ON s.emp_no = e.emp_no
WHERE dept_name = 'Production'
LIMIT 10;

 * postgresql://postgres:***@db
1 rows affected.

[(Decimal('59829'),)]

In [55]:
%%sql
SELECT salary
FROM employees e
JOIN titles t
ON e.emp_no = t.emp_no
JOIN salaries s
ON s.emp_no = e.emp_no
WHERE title = 'Senior Engineer' AND s.to_date = '9999-01-01'
ORDER BY salary ASC
LIMIT 1;

 * postgresql://postgres:***@db
1 rows affected.

[(43311,)]

In [56]:
%%sql
SELECT COUNT(DISTINCT e.emp_no)
FROM employees e
JOIN dept_emp de
ON e.emp_no = de.emp_no
JOIN departments d
ON d.dept_no = de.dept_no
WHERE d.dept_name = 'Quality Management' AND de.to_date = '9999-01-01' AND e.gender = 'F'
LIMIT 10;

 * postgresql://postgres:***@db
1 rows affected.

[(18,)]

In [57]:
%%sql
SELECT MIN(hire_date) AS min_date
FROM employees e
NATURAL JOIN dept_emp de
NATURAL JOIN departments d
WHERE dept_no = 
    (SELECT dept_no
    FROM employees e
    JOIN dept_emp de
    ON e.emp_no = de.emp_no
    GROUP BY de.dept_no
    HAVING MAX(e.hire_date) = (SELECT MAX(hire_date) AS max_hire_date
                               FROM employees))

 * postgresql://postgres:***@db
1 rows affected.

[(datetime.date(1985, 1, 1),)]

In [58]:
%%sql
SELECT first_name
FROM employees e
NATURAL JOIN titles t
WHERE t.title = 'Senior Engineer' AND e.emp_no IN
    (SELECT e.emp_no
    FROM employees e
    JOIN salaries s
    ON e.emp_no = s.emp_no
    GROUP BY e.emp_no
    HAVING COUNT(s.salary) < 5 OR COUNT(s.salary) > 15)
ORDER BY e.hire_date DESC
LIMIT 1;

 * postgresql://postgres:***@db
1 rows affected.

[('Kazuhito',)]

In [59]:
%%sql
SELECT COUNT(DISTINCT e.emp_no)
FROM employees e
JOIN dept_emp de
ON e.emp_no = de.emp_no
JOIN departments d
ON d.dept_no = de.dept_no
WHERE EXTRACT(year FROM birth_date) = 1959 AND d.dept_name = 'Research' AND de.to_date = '9999-01-01'
LIMIT 10;

 * postgresql://postgres:***@db
1 rows affected.

[(7,)]

---

# Round 6

In [60]:
%%sql
SELECT COUNT(DISTINCT first_name)
FROM employees
LIMIT 10;

 * postgresql://postgres:***@db
1 rows affected.

[(706,)]

In [61]:
%%sql
SELECT COUNT(DISTINCT emp_no)
FROM employees
WHERE gender = 'F' AND birth_date >= '1960-01-01'
LIMIT 10;

 * postgresql://postgres:***@db
1 rows affected.

[(150,)]

In [62]:
%%sql
SELECT COUNT(*)
FROM employees e
JOIN dept_emp de
ON e.emp_no = de.emp_no
JOIN departments d
ON de.dept_no = d.dept_no
WHERE dept_name = 'Research' AND to_date = '9999-01-01'
LIMIT 10;

 * postgresql://postgres:***@db
1 rows affected.

[(53,)]

In [63]:
%%sql
SELECT ROUND(AVG(salary),0)
FROM salaries s
JOIN employees e
ON s.emp_no = e.emp_no
JOIN dept_emp de
ON de.emp_no = e.emp_no
JOIN departments d
ON de.dept_no = d.dept_no
WHERE dept_name = 'Production'
LIMIT 10;

 * postgresql://postgres:***@db
1 rows affected.

[(Decimal('59829'),)]

In [64]:
%%sql
SELECT MIN(salary)
FROM employees e
JOIN salaries s
ON e.emp_no = s.emp_no
JOIN titles t
ON t.emp_no = e.emp_no
WHERE title = 'Senior Engineer' AND s.to_date = '9999-01-01'
LIMIT 10;

 * postgresql://postgres:***@db
1 rows affected.

[(43311,)]

In [65]:
%%sql
SELECT COUNT(*)
FROM employees e
JOIN dept_emp de
ON de.emp_no = e.emp_no
JOIN departments d
ON d.dept_no = de.dept_no
WHERE gender = 'F' AND to_date = '9999-01-01' AND dept_name = 'Quality Management'
LIMIT 10;

 * postgresql://postgres:***@db
1 rows affected.

[(18,)]

In [66]:
%%sql
SELECT MIN(hire_date) AS min_date
FROM employees e
JOIN dept_emp de
ON e.emp_no = de.emp_no
JOIN departments d
ON d.dept_no = de.dept_no
WHERE
d.dept_no = 
    (SELECT dept_no
    FROM 
        (SELECT dept_no, MAX(hire_date) AS max_dept_hire
        FROM employees e
        JOIN dept_emp de
        ON e.emp_no = de.emp_no
        GROUP BY dept_no)
    WHERE max_dept_hire = (SELECT MAX(hire_date) AS max_hire_date
                          FROM employees))

 * postgresql://postgres:***@db
1 rows affected.

[(datetime.date(1985, 1, 1),)]

In [67]:
%%sql
SELECT first_name
FROM employees e
JOIN titles t
ON e.emp_no = t.emp_no
WHERE e.emp_no IN (SELECT s.emp_no
                FROM employees e
                JOIN salaries s
                ON e.emp_no = s.emp_no
                GROUP BY s.emp_no
                HAVING COUNT(*) < 5 OR COUNT(*) > 15) AND title = 'Senior Engineer'
ORDER BY hire_date DESC
LIMIT 1;

 * postgresql://postgres:***@db
1 rows affected.

[('Kazuhito',)]

In [68]:
%%sql
SELECT COUNT(DISTINCT e.emp_no)
FROM employees e
JOIN dept_emp de
ON e.emp_no = de.emp_no
JOIN departments d
ON d.dept_no = de.dept_no
WHERE EXTRACT(year from birth_date) = 1959 AND dept_name = 'Research' AND to_date = '9999-01-01'
LIMIT 10;

 * postgresql://postgres:***@db
1 rows affected.

[(7,)]

---

# Round 7

In [69]:
%%sql
SELECT COUNT(DISTINCT first_name)
FROM employees
LIMIT 10;

 * postgresql://postgres:***@db
1 rows affected.

[(706,)]

In [70]:
%%sql
SELECT COUNT(*)
FROM employees
WHERE gender = 'F' AND birth_date >= '1960-01-01'
LIMIT 10;

 * postgresql://postgres:***@db
1 rows affected.

[(150,)]

In [71]:
%%sql
SELECT COUNT(DISTINCT emp_no)
FROM dept_emp de
JOIN departments d
ON de.dept_no = d.dept_no
WHERE to_date = '9999-01-01' AND dept_name = 'Research'
LIMIT 10;

 * postgresql://postgres:***@db
1 rows affected.

[(53,)]

In [72]:
%%sql
SELECT ROUND(AVG(salary),0)
FROM salaries s
JOIN dept_emp de
ON s.emp_no = de.emp_no
JOIN departments d
ON d.dept_no = de.dept_no
WHERE dept_name = 'Production'
LIMIT 10;

 * postgresql://postgres:***@db
1 rows affected.

[(Decimal('59829'),)]

In [73]:
%%sql
SELECT MIN(salary)
FROM employees e
JOIN titles t
ON e.emp_no = t.emp_no
JOIN salaries s
ON s.emp_no = e.emp_no
WHERE title = 'Senior Engineer' AND s.to_date = '9999-01-01'
LIMIT 10;

 * postgresql://postgres:***@db
1 rows affected.

[(43311,)]

In [74]:
%%sql
SELECT COUNT(*)
FROM employees e
JOIN dept_emp de
ON de.emp_no = e.emp_no
JOIN departments d
ON d.dept_no = de.dept_no
WHERE dept_name = 'Quality Management' AND gender = 'F' AND to_date = '9999-01-01'
LIMIT 10;

 * postgresql://postgres:***@db
1 rows affected.

[(18,)]

In [75]:
%%sql
SELECT MIN(hire_date) AS min_date
FROM employees e
JOIN dept_emp de
ON e.emp_no = de.emp_no
JOIN departments d
ON d.dept_no = de.dept_no
WHERE d.dept_no =
    (SELECT dept_no
    FROM
        (SELECT dept_no, MAX(hire_date) AS max_dept_hire
        FROM employees e
        JOIN dept_emp de
        ON e.emp_no = de.emp_no
        GROUP BY dept_no)
    WHERE max_dept_hire = (SELECT MAX(hire_date) AS max_hire_date
                           FROM employees))

 * postgresql://postgres:***@db
1 rows affected.

[(datetime.date(1985, 1, 1),)]

In [76]:
%%sql
SELECT e.emp_no, e.first_name
FROM employees e
JOIN salaries s
ON e.emp_no = s.emp_no
JOIN titles t
ON t.emp_no = e.emp_no
WHERE t.title = 'Senior Engineer'
GROUP BY e.emp_no
HAVING COUNT(salary) < 5 OR COUNT(salary) > 15
ORDER BY hire_date DESC
LIMIT 1;

 * postgresql://postgres:***@db
1 rows affected.

[(10552, 'Kazuhito')]

In [77]:
%%sql
SELECT COUNT(DISTINCT e.emp_no)
FROM employees e
JOIN dept_emp de
ON e.emp_no = de.emp_no
JOIN departments d
ON d.dept_no = de.dept_no
WHERE EXTRACT(year FROM birth_date) = 1959 AND d.dept_name = 'Research' AND to_date = '9999-01-01'
LIMIT 10;

 * postgresql://postgres:***@db
1 rows affected.

[(7,)]

---

# Round 8

In [78]:
%%sql
SELECT COUNT(DISTINCT first_name)
FROM employees
LIMIT 10;

 * postgresql://postgres:***@db
1 rows affected.

[(706,)]

In [79]:
%%sql
SELECT COUNT(*)
FROM employees
WHERE gender = 'F' AND birth_date >= '1960-01-01'
LIMIT 10;

 * postgresql://postgres:***@db
1 rows affected.

[(150,)]

In [80]:
%%sql
SELECT COUNT(*)
FROM employees e
JOIN dept_emp de
ON e.emp_no = de.emp_no
JOIN departments d
ON d.dept_no = de.dept_no
WHERE dept_name = 'Research' AND to_date = '9999-01-01'
LIMIT 10;

 * postgresql://postgres:***@db
1 rows affected.

[(53,)]

In [81]:
%%sql
SELECT ROUND(AVG(salary), 0)
FROM employees e
JOIN dept_emp de
ON e.emp_no = de.emp_no
JOIN departments d
ON d.dept_no = de.dept_no
JOIN salaries s
ON s.emp_no = e.emp_no
WHERE dept_name = 'Production'
LIMIT 10;

 * postgresql://postgres:***@db
1 rows affected.

[(Decimal('59829'),)]

In [82]:
%%sql
SELECT MIN(salary)
FROM employees e
JOIN salaries s
ON s.emp_no = e.emp_no
JOIN titles t
ON t.emp_no = e.emp_no
WHERE title = 'Senior Engineer' AND s.to_date = '9999-01-01'
LIMIT 10;

 * postgresql://postgres:***@db
1 rows affected.

[(43311,)]

In [83]:
%%sql
SELECT COUNT(*)
FROM employees e
JOIN dept_emp de
ON de.emp_no = e.emp_no
JOIN departments d
ON d.dept_no = de.dept_no
WHERE dept_name = 'Quality Management' AND gender = 'F' AND to_date = '9999-01-01'
LIMIT 10;

 * postgresql://postgres:***@db
1 rows affected.

[(18,)]

In [84]:
%%sql
SELECT MIN(hire_date) AS min_date
FROM employees e
JOIN dept_emp de
ON e.emp_no = de.emp_no
JOIN departments d
ON d.dept_no = de.dept_no
WHERE d.dept_no =
    (SELECT dept_no
    FROM
        (SELECT dept_no, MAX(hire_date) AS max_dept_hire
        FROM employees e
        JOIN dept_emp de
        ON e.emp_no = de.emp_no
        GROUP BY dept_no)
    WHERE max_dept_hire = (SELECT MAX(hire_date) AS max_hire_date
                            FROM employees))

 * postgresql://postgres:***@db
1 rows affected.

[(datetime.date(1985, 1, 1),)]

In [85]:
%%sql
SELECT e.emp_no, e.first_name
FROM employees e
JOIN salaries s
ON s.emp_no = e.emp_no
JOIN titles t
ON e.emp_no = t.emp_no
WHERE title = 'Senior Engineer'
GROUP BY e.emp_no, e.first_name
ORDER BY MAX(hire_date) DESC
LIMIT 1;

 * postgresql://postgres:***@db
1 rows affected.

[(10552, 'Kazuhito')]

In [86]:
%%sql
SELECT COUNT(*)
FROM employees e
JOIN dept_emp de
ON e.emp_no = de.emp_no
JOIN departments d
ON de.dept_no = d.dept_no
WHERE d.dept_name = 'Research' AND de.to_date = '9999-01-01' AND EXTRACT(year FROM e.birth_date) = 1959 
LIMIT 10;

 * postgresql://postgres:***@db
1 rows affected.

[(7,)]

---

# Round 9

In [87]:
%%sql
SELECT COUNT(DISTINCT first_name)
FROM employees
LIMIT 10;

 * postgresql://postgres:***@db
1 rows affected.

[(706,)]

In [88]:
%%sql
SELECT COUNT(*)
FROM employees
WHERE gender = 'F' AND birth_date >= '1960-01-01'
LIMIT 10;

 * postgresql://postgres:***@db
1 rows affected.

[(150,)]

In [89]:
%%sql
SELECT COUNT(*)
FROM employees e
JOIN dept_emp de
ON de.emp_no = e.emp_no
JOIN departments d
ON d.dept_no = de.dept_no
WHERE d.dept_name = 'Research' AND to_date = '9999-01-01'
LIMIT 10;

 * postgresql://postgres:***@db
1 rows affected.

[(53,)]

In [90]:
%%sql
SELECT ROUND(AVG(salary),0)
FROM employees e
JOIN dept_emp de
ON e.emp_no = de.emp_no
JOIN departments d
ON d.dept_no = de.dept_no
JOIN salaries s
ON s.emp_no = e.emp_no
WHERE dept_name = 'Production'
LIMIT 10;

 * postgresql://postgres:***@db
1 rows affected.

[(Decimal('59829'),)]

In [91]:
%%sql
SELECT MIN(salary)
FROM employees e
JOIN titles t
ON e.emp_no = t.emp_no
JOIN salaries s
ON s.emp_no = t.emp_no
WHERE title = 'Senior Engineer' AND s.to_date = '9999-01-01'
LIMIT 10;

 * postgresql://postgres:***@db
1 rows affected.

[(43311,)]

In [92]:
%%sql
SELECT COUNT(*)
FROM employees e
JOIN dept_emp de
ON de.emp_no = e.emp_no
JOIN departments d
ON d.dept_no = de.dept_no
WHERE dept_name = 'Quality Management' AND gender = 'F' AND to_date = '9999-01-01'
LIMIT 10;

 * postgresql://postgres:***@db
1 rows affected.

[(18,)]

In [93]:
%%sql
SELECT MIN(hire_date) AS min_date
FROM employees e
JOIN dept_emp de
ON e.emp_no = de.emp_no
JOIN departments d
ON d.dept_no = de.dept_no
WHERE de.dept_no =
    (SELECT dept_no AS max_dept_hire
    FROM
        (SELECT dept_no, MAX(hire_date) AS max_dept_hire
        FROM employees e
        JOIN dept_emp de
        ON e.emp_no = de.emp_no
        GROUP BY dept_no)
    WHERE max_dept_hire = (SELECT MAX(hire_date) AS max_hire_date FROM employees))

 * postgresql://postgres:***@db
1 rows affected.

[(datetime.date(1985, 1, 1),)]

In [94]:
%%sql
SELECT e.emp_no, e.first_name
FROM employees e
JOIN salaries s
ON e.emp_no = s.emp_no
JOIN titles t
ON t.emp_no = e.emp_no
WHERE title = 'Senior Engineer'
GROUP BY e.emp_no
HAVING COUNT(salary) < 5 OR COUNT(salary) > 15
ORDER BY hire_date DESC
LIMIT 1;

 * postgresql://postgres:***@db
1 rows affected.

[(10552, 'Kazuhito')]

In [95]:
%%sql
SELECT COUNT(DISTINCT e.emp_no)
FROM employees e
JOIN dept_emp de
ON e.emp_no = de.emp_no
JOIN departments d
ON d.dept_no = de.dept_no
WHERE EXTRACT(year FROM birth_date) = 1959  AND dept_name = 'Research' AND to_date = '9999-01-01'
LIMIT 10;

 * postgresql://postgres:***@db
1 rows affected.

[(7,)]

In [96]:
%%sql

LIMIT 10;

 * postgresql://postgres:***@db
(psycopg2.errors.SyntaxError) syntax error at or near "LIMIT"
LINE 1: LIMIT 10;
        ^

[SQL: LIMIT 10;]
(Background on this error at: https://sqlalche.me/e/14/f405)

---

# Round 10

In [98]:
%%sql
SELECT COUNT(DISTINCT first_name)
FROM employees
LIMIT 10;

 * postgresql://postgres:***@db
1 rows affected.

[(706,)]

In [106]:
%%sql
SELECT COUNT(DISTINCT emp_no)
FROM employees
WHERE gender = 'F' AND birth_date >= '1960-01-01'
LIMIT 10;

 * postgresql://postgres:***@db
1 rows affected.

[(150,)]

In [115]:
%%sql
SELECT COUNT(*)
FROM employees e
JOIN dept_emp de
ON de.emp_no = e.emp_no
JOIN departments d
ON d.dept_no = de.dept_no
WHERE d.dept_name = 'Research' AND to_date = '9999-01-01'
LIMIT 10;

 * postgresql://postgres:***@db
1 rows affected.

[(53,)]

In [120]:
%%sql
SELECT MIN(salary)
FROM employees e
JOIN salaries s
ON e.emp_no = s.emp_no
JOIN titles t
ON t.emp_no = e.emp_no
WHERE title = 'Senior Engineer' AND s.to_date = '9999-01-01'
LIMIT 10;

 * postgresql://postgres:***@db
1 rows affected.

[(43311,)]

In [126]:
%%sql
SELECT COUNT(*)
FROM employees e
JOIN dept_emp de
ON e.emp_no = de.emp_no
JOIN departments d
ON d.dept_no = de.dept_no
WHERE gender = 'F' AND dept_name = 'Quality Management' AND to_date = '9999-01-01'
LIMIT 10;

 * postgresql://postgres:***@db
1 rows affected.

[(18,)]

In [132]:
%%sql
SELECT MIN(hire_date) AS min_date
FROM employees e
JOIN dept_emp de
ON e.emp_no = de.emp_no
JOIN departments d
ON d.dept_no = de.dept_no
WHERE d.dept_no =
    (SELECT dept_no
    FROM
        (SELECT dept_no, MAX(hire_date) AS max_dept_hire
        FROM employees e
        JOIN dept_emp de
        ON e.emp_no = de.emp_no
        GROUP BY dept_no)
    WHERE max_dept_hire = (SELECT MAX(hire_date) AS max_hire_date FROM employees));

 * postgresql://postgres:***@db
1 rows affected.

[(datetime.date(1985, 1, 1),)]

In [140]:
%%sql
SELECT e.emp_no, e.first_name
FROM employees e
JOIN salaries s
ON e.emp_no = s.emp_no
JOIN titles t
ON t.emp_no = e.emp_no
WHERE title = 'Senior Engineer'
GROUP BY e.emp_no
HAVING COUNT(salary) < 5 OR COUNT(salary) > 15
ORDER BY hire_date DESC
LIMIT 1;

 * postgresql://postgres:***@db
1 rows affected.

[(10552, 'Kazuhito')]

In [147]:
%%sql
SELECT COUNT(e.emp_no)
FROM employees e
JOIN dept_emp de
ON e.emp_no = de.emp_no
JOIN departments d
ON d.dept_no = de.dept_no
WHERE EXTRACT(year FROM birth_date) = 1959 AND dept_name = 'Research' AND to_date = '9999-01-01'
LIMIT 10;

 * postgresql://postgres:***@db
1 rows affected.

[(7,)]

---